In [2]:
import pandas as pd
import datetime

In [4]:
data = pd.read_csv('../dataset/csv/concat/time_series.csv')

In [5]:
data.head()

   ID          Datetime  Count
0   0  25-08-2012 00:00      8
1   1  25-08-2012 01:00      2
2   2  25-08-2012 02:00      6
3   3  25-08-2012 03:00      2
4   4  25-08-2012 04:00      2

In [6]:
data.dtypes

ID           int64
Datetime    object
Count        int64
dtype: object

In [7]:
data.Datetime = pd.to_datetime(data.Datetime)

In [8]:
data.dtypes

ID                   int64
Datetime    datetime64[ns]
Count                int64
dtype: object

In [9]:
data.head()

   ID            Datetime  Count
0   0 2012-08-25 00:00:00      8
1   1 2012-08-25 01:00:00      2
2   2 2012-08-25 02:00:00      6
3   3 2012-08-25 03:00:00      2
4   4 2012-08-25 04:00:00      2

In [10]:
data.Datetime.apply(lambda x: x.day_name())

0        Saturday
1        Saturday
2        Saturday
3        Saturday
4        Saturday
           ...
18283    Thursday
18284    Thursday
18285    Thursday
18286    Thursday
18287    Thursday
Name: Datetime, Length: 18288, dtype: object

In [11]:
data.Datetime.apply(lambda x: x.day_name())

0        Saturday
1        Saturday
2        Saturday
3        Saturday
4        Saturday
           ...
18283    Thursday
18284    Thursday
18285    Thursday
18286    Thursday
18287    Thursday
Name: Datetime, Length: 18288, dtype: object

In [10]:
data.Datetime.apply(lambda x: x.month_name())

0           August
1           August
2           August
3           August
4           August
           ...
18283    September
18284    September
18285    September
18286    September
18287    September
Name: Datetime, Length: 18288, dtype: object

In [11]:
data_2 = pd.read_csv('dataset/csv/concat/time_series_2.csv')

In [12]:
data_2.head()

   ID      Datetime  Count
0   0  25 Aug 2012       8
1   1  25 Aug 2012       2
2   2  25 Aug 2012       6
3   3  25 Aug 2012       2
4   4  25 Aug 2012       2

In [14]:
data_2.Datetime = pd.to_datetime(data_2.Datetime, format='%d %b %Y ')

In [15]:
data_2.head()

   ID   Datetime  Count
0   0 2012-08-25      8
1   1 2012-08-25      2
2   2 2012-08-25      6
3   3 2012-08-25      2
4   4 2012-08-25      2

In [16]:
data_2.dtypes

ID                   int64
Datetime    datetime64[ns]
Count                int64
dtype: object

In [17]:
data['month'] = data_2.Datetime.dt.month

In [18]:
data.head()

   ID            Datetime  Count  month
0   0 2012-08-25 00:00:00      8      8
1   1 2012-08-25 01:00:00      2      8
2   2 2012-08-25 02:00:00      6      8
3   3 2012-08-25 03:00:00      2      8
4   4 2012-08-25 04:00:00      2      8

In [19]:
data['month_name'] = data_2.Datetime.dt.month_name()

In [20]:
data.head()

   ID            Datetime  Count  month month_name
0   0 2012-08-25 00:00:00      8      8     August
1   1 2012-08-25 01:00:00      2      8     August
2   2 2012-08-25 02:00:00      6      8     August
3   3 2012-08-25 03:00:00      2      8     August
4   4 2012-08-25 04:00:00      2      8     August

In [21]:
data.head()

   ID            Datetime  Count  month month_name
0   0 2012-08-25 00:00:00      8      8     August
1   1 2012-08-25 01:00:00      2      8     August
2   2 2012-08-25 02:00:00      6      8     August
3   3 2012-08-25 03:00:00      2      8     August
4   4 2012-08-25 04:00:00      2      8     August

In [22]:
data['today'] = pd.to_datetime(datetime.date.today())

In [23]:
data.head()

   ID            Datetime  Count  month month_name      today
0   0 2012-08-25 00:00:00      8      8     August 2020-10-25
1   1 2012-08-25 01:00:00      2      8     August 2020-10-25
2   2 2012-08-25 02:00:00      6      8     August 2020-10-25
3   3 2012-08-25 03:00:00      2      8     August 2020-10-25
4   4 2012-08-25 04:00:00      2      8     August 2020-10-25

In [24]:
difference_of_dates = data['today'] - data['Datetime']

In [25]:
difference_of_dates

0       2983 days 00:00:00
1       2982 days 23:00:00
2       2982 days 22:00:00
3       2982 days 21:00:00
4       2982 days 20:00:00
               ...
18283   2221 days 05:00:00
18284   2221 days 04:00:00
18285   2221 days 03:00:00
18286   2221 days 02:00:00
18287   2221 days 01:00:00
Length: 18288, dtype: timedelta64[ns]

In [26]:
data['day_diff'] = difference_of_dates.apply(lambda x: x.days)

In [27]:
data.head()

   ID            Datetime  Count  month month_name      today  day_diff
0   0 2012-08-25 00:00:00      8      8     August 2020-10-25      2983
1   1 2012-08-25 01:00:00      2      8     August 2020-10-25      2982
2   2 2012-08-25 02:00:00      6      8     August 2020-10-25      2982
3   3 2012-08-25 03:00:00      2      8     August 2020-10-25      2982
4   4 2012-08-25 04:00:00      2      8     August 2020-10-25      2982

In [28]:
data['asia_timezone'] = data.Datetime.dt.tz_localize('Asia/Calcutta')

In [29]:
data.head()

,ID,Datetime,Count,month,month_name,today,day_diff,asia_timezone
0,0,2012-08-25 00:00:00,8,8,August,2020-10-25,2983,2012-08-25 00:00:00+05:30
1,1,2012-08-25 01:00:00,2,8,August,2020-10-25,2982,2012-08-25 01:00:00+05:30
2,2,2012-08-25 02:00:00,6,8,August,2020-10-25,2982,2012-08-25 02:00:00+05:30
3,3,2012-08-25 03:00:00,2,8,August,2020-10-25,2982,2012-08-25 03:00:00+05:30
4,4,2012-08-25 04:00:00,2,8,August,2020-10-25,2982,2012-08-25 04:00:00+05:30

In [30]:
data['utc_timezone'] = data.asia_timezone.dt.tz_convert('UTC')

In [31]:
data.head()

,ID,Datetime,Count,month,month_name,today,day_diff,asia_timezone,utc_timezone
0,0,2012-08-25 00:00:00,8,8,August,2020-10-25,2983,2012-08-25 00:00:00+05:30,2012-08-24 18:30:00+00:00
1,1,2012-08-25 01:00:00,2,8,August,2020-10-25,2982,2012-08-25 01:00:00+05:30,2012-08-24 19:30:00+00:00
2,2,2012-08-25 02:00:00,6,8,August,2020-10-25,2982,2012-08-25 02:00:00+05:30,2012-08-24 20:30:00+00:00
3,3,2012-08-25 03:00:00,2,8,August,2020-10-25,2982,2012-08-25 03:00:00+05:30,2012-08-24 21:30:00+00:00
4,4,2012-08-25 04:00:00,2,8,August,2020-10-25,2982,2012-08-25 04:00:00+05:30,2012-08-24 22:30:00+00:00

In [33]:
data_with_unix_ts = pd.read_csv('dataset/csv/concat/data_with_timestamp.csv')

In [34]:
data_with_unix_ts.head()

   ID   timestamp  Count
0   0  1345852800      8
1   1  1345856400      2
2   2  1345860000      6
3   3  1345863600      2
4   4  1345867200      2

In [35]:
data_with_unix_ts.timestamp = pd.to_datetime(data_with_unix_ts.timestamp, unit='s')

In [36]:
data_with_unix_ts.head()

   ID           timestamp  Count
0   0 2012-08-25 00:00:00      8
1   1 2012-08-25 01:00:00      2
2   2 2012-08-25 02:00:00      6
3   3 2012-08-25 03:00:00      2
4   4 2012-08-25 04:00:00      2